/*----------------------------------------------------------------------------*/
/* basic_f.c                                                                  */
/*                                                                            */
/* 项目公用的基础函数集                                                       */
/* 2014/5/30 manwjh 建立                                                      */
/*                                                                            */
/*----------------------------------------------------------------------------*/

/* include */
#include "integer.h"
#include "basic_f.h"

/* external */


/* public */


/* private */


/* debug */


/*----------------------------------------------------------------------------*/
/*                                  Functions                                 */
/*----------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------*/
/* 函数名称: bool DecChar2Int(char *in, int *re_int, int k)                   */
/* 函数描述: 将十进制的字符转换成int                                          */
/*           *in: 输入字符缓冲指针                                            */
/*           *re_int: 返回int型数据到这个指针位置                             */
/*           k: 转换的字符位数, 如需要分析"12", 则K=2                         */
/*                                                                            */
/*----------------------------------------------------------------------------*/

bool DecChar2Int(char *in, int *re_int, int k)
{
    char tmp;
    int c_int=0;
    
    if( (k<1)||(k>4) )
        return false;

    if( k==4 ){
        tmp = *in++;
        c_int += (tmp&0x0f)*1000;
    }
    if( k>=3 ){
        tmp = *in++;
        c_int += (tmp&0x0f)*100;
    }
    if( k>=2 ){
        tmp = *in++;
        c_int += (tmp&0x0f)*10;
    }
    if( k>=1 ){
        tmp = *in++;
        c_int += (tmp&0x0f);
    }

    *re_int = c_int;

    return true;
}

void Int2DecStr(int num, char *out_p)
{	
    char *p = out_p;
    int k;
    
    k = num/10000;
    if(k>0){
        *p++ = k+'0';
        num = num-k*10000;
    }
    
    k = num/1000;
    if(k>0){
        *p++ = k+'0';
        num = num-k*1000;
    }
    
    k = num/100;
    if(k>0){
        *p++ = k+'0';
        num = num-k*100;
    }
    
    k = num/10;
    if(k>0){
        *p++ = k+'0';
        num = num-k*10;
    }
    
    *p++ = num%10+'0';
    
    *p = '\0';
    
}



